import UIKit

// 内置的数据类型：
// 一、整型
// 1.Int,Int32,Int64
// 在32位平台上，Int和Int32长度相同。
// 在64位平台上，Int和Int64长度相同。
// 除非你需要特定长度的整数，一般来说使用Int就够了。这可以提高代码一致性和可复用性。
// 2.UInt,UInt32,UInt64
// 这是无符号的整型
// 在32位平台上，UInt和UInt32长度相同。
// 在64位平台上，UInt和UInt64长度相同。
// 所以，同Int一样的道理，能用UInt就不要用UInt32或UInt64
// 总结来说，我们最好使用Int，偶尔使用Int32或Int64,尽量不使用UInt。

// 二、浮点型
// 1.Double
// 表示64位浮点数,至少有15位数字
// 2.Float
// 表示32位浮点数,最少只有6位数字
// 选择哪个类型取决于你的代码需要处理的值的范围。

// 三、布尔值(Bool)

// 四、字符串(String)

// 五、字符(Char)

// 六、可选类型(Optional)

// 七、Array

// 八、Dictionary




